Repository: kindrakevich-agency/constructor
Catalog: web/modules/custom/constructor_hero/translations/*.po
Languages: uk

source: Hero Block
uk: Блок героя

source: Constructor
uk: Конструктор

source: Title
uk: Заголовок

source: Title prefix
uk: Префікс заголовка

source: Text before the highlighted word.
uk: Текст перед виділеним словом.

source: Highlighted word
uk: Виділене слово

source: Word with underline decoration.
uk: Слово з підкресленням.

source: Title suffix
uk: Суфікс заголовка

source: Text after the highlighted word.
uk: Текст після виділеного слова.

source: Description
uk: Опис

source: Email Form
uk: Форма електронної пошти

source: Show email form
uk: Показати форму електронної пошти

source: Email placeholder
uk: Плейсхолдер електронної пошти

source: Button text
uk: Текст кнопки

source: Statistics
uk: Статистика

source: Show statistics
uk: Показати статистику

source: Stat 1 value
uk: Значення статистики 1

source: Stat 1 label
uk: Мітка статистики 1

source: Stat 2 value
uk: Значення статистики 2

source: Stat 2 label
uk: Мітка статистики 2

source: Rating
uk: Рейтинг

source: Show rating
uk: Показати рейтинг

source: Rating value
uk: Значення рейтингу

source: Rating text
uk: Текст рейтингу

source: Image
uk: Зображення

source: Image URL
uk: URL зображення

source: URL of the hero image.
uk: URL зображення героя.

source: Image alt text
uk: Альтернативний текст зображення

source: Floating Card
uk: Плаваюча картка

source: Show floating card
uk: Показати плаваючу картку

source: Floating card value
uk: Значення плаваючої картки

source: Floating card text
uk: Текст плаваючої картки

source: What We Do Block
uk: Блок «Що ми робимо»

source: Badge
uk: Бейдж

source: Badge text
uk: Текст бейджа

source: Buttons
uk: Кнопки

source: Show primary button
uk: Показати основну кнопку

source: Primary button text
uk: Текст основної кнопки

source: Primary button URL
uk: URL основної кнопки

source: Show secondary link
uk: Показати додаткове посилання

source: Secondary link text
uk: Текст додаткового посилання

source: Secondary link URL
uk: URL додаткового посилання

source: Booking Modal
uk: Модальне вікно бронювання

source: Modal Settings
uk: Налаштування модального вікна

source: Modal title
uk: Заголовок модального вікна

source: Modal description
uk: Опис модального вікна

source: Header Button
uk: Кнопка в шапці

source: Show "Book a demo" button in header
uk: Показати кнопку «Замовити демо» в шапці

source: Display a button in the header that opens the booking modal.
uk: Відобразити кнопку в шапці, яка відкриває модальне вікно бронювання.

source: Header button text
uk: Текст кнопки в шапці

source: Name Field
uk: Поле імені

source: Show name field
uk: Показати поле імені

source: Label
uk: Мітка

source: Placeholder
uk: Плейсхолдер

source: Required
uk: Обов'язкове

source: Email Field
uk: Поле електронної пошти

source: Show email field
uk: Показати поле електронної пошти

source: Company Field
uk: Поле компанії

source: Show company field
uk: Показати поле компанії

source: Phone Field
uk: Поле телефону

source: Show phone field
uk: Показати поле телефону

source: Message Field
uk: Поле повідомлення

source: Show message field
uk: Показати поле повідомлення

source: Submit Button
uk: Кнопка відправки

source: Submit button text
uk: Текст кнопки відправки

source: Book a demo
uk: Замовити демо

source: Book Now
uk: Замовити зараз

source: Book a Consultation
uk: Замовити консультацію

source: Fill out the form below and we will get back to you shortly.
uk: Заповніть форму нижче, і ми зв'яжемося з вами найближчим часом.

source: Full Name
uk: Повне ім'я

source: Enter your full name
uk: Введіть ваше повне ім'я

source: Email
uk: Електронна пошта

source: Enter your email address
uk: Введіть вашу електронну адресу

source: Company
uk: Компанія

source: Enter your company name
uk: Введіть назву вашої компанії

source: Phone
uk: Телефон

source: Enter your phone number
uk: Введіть ваш номер телефону

source: Message
uk: Повідомлення

source: Tell us about your project...
uk: Розкажіть нам про ваш проект...

source: Submit Request
uk: Надіслати запит

source: Thank you! We will contact you shortly.
uk: Дякуємо! Ми зв'яжемося з вами найближчим часом.

source: Close
uk: Закрити

source: Send
uk: Надіслати
