Repository: kindrakevich-agency/constructor
Catalog: web/profiles/custom/constructor/translations/constructor-1.0.0.*.po
Languages: uk

source: Back
uk: Назад

source: Continue
uk: Продовжити

source: Finish Installation
uk: Завершити встановлення

source: Site Basics
uk: Основні налаштування

source: Configure basic site settings
uk: Налаштуйте базові параметри сайту

source: Site Information
uk: Інформація про сайт

source: Enter basic information about your website.
uk: Введіть основну інформацію про ваш веб-сайт.

source: Site Name
uk: Назва сайту

source: My Awesome Website
uk: Мій чудовий веб-сайт

source: Site Slogan
uk: Слоган сайту

source: A catchy tagline for your site
uk: Привабливий слоган для вашого сайту

source: Site Email
uk: Email сайту

source: This email will be used for system notifications.
uk: Цей email буде використовуватися для системних сповіщень.

source: Administrator Account
uk: Обліковий запис адміністратора

source: Create the main administrator account for your site.
uk: Створіть основний обліковий запис адміністратора для вашого сайту.

source: Username
uk: Ім'я користувача

source: Languages
uk: Мови

source: Select languages for your site
uk: Виберіть мови для вашого сайту

source: Language Configuration
uk: Налаштування мов

source: Configure the languages for your site. You can add more languages later.
uk: Налаштуйте мови для вашого сайту. Ви можете додати більше мов пізніше.

source: Default Language
uk: Мова за замовчуванням

source: Select the primary language for your site.
uk: Виберіть основну мову для вашого сайту.

source: Enable multilingual support
uk: Увімкнути багатомовну підтримку

source: Enable this to add support for multiple languages.
uk: Увімкніть це, щоб додати підтримку кількох мов.

source: Additional Languages
uk: Додаткові мови

source: Select additional languages
uk: Виберіть додаткові мови

source: Select the additional languages you want to enable.
uk: Виберіть додаткові мови, які ви хочете увімкнути.

source: Translation Settings
uk: Налаштування перекладу

source: Enable content translation
uk: Увімкнути переклад контенту

source: Allow translating content into multiple languages.
uk: Дозволити переклад контенту на різні мови.

source: Enable interface translation
uk: Увімкнути переклад інтерфейсу

source: Allow translating the user interface.
uk: Дозволити переклад інтерфейсу користувача.

source: Content Types
uk: Типи контенту

source: Define your content structure
uk: Визначте структуру вашого контенту

source: Select Content Types
uk: Виберіть типи контенту

source: Choose the content types you need for your site. You can add or modify them later.
uk: Виберіть типи контенту, які вам потрібні. Ви можете додати або змінити їх пізніше.

source: Basic Page
uk: Базова сторінка

source: Use basic pages for static content like About us, Contact.
uk: Використовуйте базові сторінки для статичного контенту, як-от Про нас, Контакти.

source: Article
uk: Стаття

source: Use articles for time-sensitive content like news, blog posts.
uk: Використовуйте статті для актуального контенту, як-от новини, блог-пости.

source: Landing Page
uk: Лендінг

source: Flexible landing pages with customizable sections.
uk: Гнучкі лендінги з налаштовуваними секціями.

source: Event
uk: Подія

source: Events with date, location, and registration.
uk: Події з датою, місцем та реєстрацією.

source: Service
uk: Послуга

source: Services or products your organization offers.
uk: Послуги або продукти, які пропонує ваша організація.

source: Team Member
uk: Член команди

source: Staff profiles with photo, bio, and contact info.
uk: Профілі співробітників з фото, біографією та контактами.

source: FAQ
uk: Часті запитання

source: Frequently asked questions with answers.
uk: Часті запитання з відповідями.

source: Testimonial
uk: Відгук

source: Customer testimonials and reviews.
uk: Відгуки та рецензії клієнтів.

source: Add Custom Content Type
uk: Додати власний тип контенту

source: Optionally create a custom content type during installation.
uk: За бажанням створіть власний тип контенту під час встановлення.

source: Custom Content Type
uk: Власний тип контенту

source: Machine Name
uk: Машинна назва

source: Display Name
uk: Назва для відображення

source: e.g., Portfolio Item
uk: напр., Елемент портфоліо

source: Description
uk: Опис

source: Brief description of this content type...
uk: Короткий опис цього типу контенту...

source: Default Fields
uk: Поля за замовчуванням

source: Each content type will include these base fields by default:
uk: Кожен тип контенту міститиме ці базові поля за замовчуванням:

source: You can customize fields for each content type after installation.
uk: Ви можете налаштувати поля для кожного типу контенту після встановлення.

source: Modules
uk: Модулі

source: Enable additional functionality
uk: Увімкніть додаткову функціональність

source: Core Modules
uk: Основні модулі

source: Select additional Drupal core modules to enable.
uk: Виберіть додаткові модулі ядра Drupal для активації.

source: Contact
uk: Контакт

source: Enables contact forms on your site.
uk: Вмикає контактні форми на вашому сайті.

source: Search
uk: Пошук

source: Enables site-wide keyword searching.
uk: Вмикає пошук за ключовими словами по всьому сайту.

source: Media
uk: Медіа

source: Media management and library.
uk: Управління медіа та бібліотека.

source: Media Library
uk: Медіа бібліотека

source: Enhanced media browser and selection.
uk: Покращений браузер та вибір медіа.

source: Responsive Image
uk: Адаптивні зображення

source: Provides responsive image styles.
uk: Надає адаптивні стилі зображень.

source: Custom Menu Links
uk: Власні пункти меню

source: Allows creating custom menu items.
uk: Дозволяє створювати власні пункти меню.

source: Shortcut
uk: Ярлик

source: Quick links for administrators.
uk: Швидкі посилання для адміністраторів.

source: Book
uk: Книга

source: Create hierarchical content like documentation.
uk: Створення ієрархічного контенту, як-от документація.

source: Statistics
uk: Статистика

source: Track page views and popular content.
uk: Відстеження переглядів сторінок та популярного контенту.

source: Custom Modules
uk: Власні модулі

source: These custom modules are included with Constructor profile.
uk: Ці власні модулі включені до профілю Constructor.

source: SEO Settings
uk: Налаштування SEO

source: Configure search engine optimization settings.
uk: Налаштуйте параметри оптимізації для пошукових систем.

source: Configure default SEO settings
uk: Налаштувати параметри SEO за замовчуванням

source: Set up default metatag patterns and sitemap configuration.
uk: Налаштуйте шаблони метатегів та конфігурацію карти сайту.

source: Generate robots.txt
uk: Згенерувати robots.txt

source: Create a default robots.txt file for search engines.
uk: Створити файл robots.txt за замовчуванням для пошукових систем.

source: Design & Layout
uk: Дизайн та макет

source: Configure site appearance
uk: Налаштуйте зовнішній вигляд сайту

source: Configure your site appearance
uk: Налаштуйте зовнішній вигляд вашого сайту

source: Theme Settings
uk: Налаштування теми

source: Configure the visual appearance of your site.
uk: Налаштуйте візуальне оформлення вашого сайту.

source: Color Scheme
uk: Колірна схема

source: Blue (Default)
uk: Синій (за замовчуванням)

source: Green
uk: Зелений

source: Purple
uk: Фіолетовий

source: Orange
uk: Помаранчевий

source: Red
uk: Червоний

source: Dark
uk: Темний

source: Select the primary color scheme for your site.
uk: Виберіть основну колірну схему для вашого сайту.

source: Enable dark mode toggle
uk: Увімкнути перемикач темного режиму

source: Allow visitors to switch between light and dark themes.
uk: Дозволити відвідувачам перемикатися між світлою та темною темами.

source: Front Page Layout
uk: Макет головної сторінки

source: Configure the layout and content for your front page.
uk: Налаштуйте макет та контент для вашої головної сторінки.

source: Front Page Type
uk: Тип головної сторінки

source: Default content listing
uk: Список контенту за замовчуванням

source: Specific page/node
uk: Конкретна сторінка/вузол

source: Custom blocks layout
uk: Макет з власних блоків

source: Block Regions
uk: Регіони блоків

source: Select which blocks to display in each region.
uk: Виберіть, які блоки відображати в кожному регіоні.

source: Header Region
uk: Регіон заголовка

source: Site branding (logo & name)
uk: Брендинг сайту (логотип та назва)

source: Main navigation menu
uk: Головне навігаційне меню

source: Search form
uk: Форма пошуку

source: Sidebar Region
uk: Регіон бічної панелі

source: Enable sidebar
uk: Увімкнути бічну панель

source: Secondary navigation
uk: Додаткова навігація

source: Recent content block
uk: Блок нещодавнього контенту

source: Popular tags cloud
uk: Хмара популярних тегів

source: Footer Region
uk: Регіон підвалу

source: Footer menu
uk: Меню підвалу

source: Copyright notice
uk: Повідомлення про авторські права

source: Social media links
uk: Посилання на соціальні мережі

source: AI Integration
uk: Інтеграція з ШІ

source: Set up AI content generation
uk: Налаштуйте генерацію контенту за допомогою ШІ

source: OpenAI Integration
uk: Інтеграція з OpenAI

source: Configure OpenAI Provider module for AI-powered content generation and image creation.
uk: Налаштуйте модуль OpenAI Provider для генерації контенту та зображень за допомогою ШІ.

source: API Configuration
uk: Налаштування API

source: OpenAI API Key
uk: API ключ OpenAI

source: Enter your OpenAI API key. Get one from <a href="https://platform.openai.com/api-keys" target="_blank" class="text-blue-600 hover:underline">platform.openai.com</a>.
uk: Введіть ваш API ключ OpenAI. Отримайте його на <a href="https://platform.openai.com/api-keys" target="_blank" class="text-blue-600 hover:underline">platform.openai.com</a>.

source: Model Settings
uk: Налаштування моделі

source: Text Generation Model
uk: Модель генерації тексту

source: Select the default AI model for text/content generation.
uk: Виберіть модель ШІ за замовчуванням для генерації тексту/контенту.

source: Image Generation Model
uk: Модель генерації зображень

source: Select the default AI model for image generation.
uk: Виберіть модель ШІ за замовчуванням для генерації зображень.

source: Temperature
uk: Температура

source: Controls randomness. Lower = more focused, higher = more creative.
uk: Контролює випадковість. Нижче = більш сфокусовано, вище = більш креативно.

source: Max Tokens
uk: Максимум токенів

source: Maximum length of generated content.
uk: Максимальна довжина згенерованого контенту.

source: Image Generation Settings
uk: Налаштування генерації зображень

source: Default Image Size
uk: Розмір зображення за замовчуванням

source: Default size for DALL-E generated images.
uk: Розмір за замовчуванням для зображень, згенерованих DALL-E.

source: Image Quality
uk: Якість зображення

source: Standard
uk: Стандартна

source: HD (Higher detail, slower)
uk: HD (вища деталізація, повільніше)

source: Quality setting for DALL-E 3 images.
uk: Налаштування якості для зображень DALL-E 3.

source: Content Generation Features
uk: Функції генерації контенту

source: Enable AI-powered features for content creation.
uk: Увімкніть функції на основі ШІ для створення контенту.

source: Enable AI content suggestions
uk: Увімкнути пропозиції контенту від ШІ

source: Show AI generation button on content edit forms.
uk: Показувати кнопку генерації ШІ на формах редагування контенту.

source: Enable AI SEO generation
uk: Увімкнути генерацію SEO за допомогою ШІ

source: Allow AI to generate meta descriptions and SEO content.
uk: Дозволити ШІ генерувати мета-описи та SEO контент.

source: Enable AI image generation
uk: Увімкнути генерацію зображень ШІ

source: Allow AI to generate images using DALL-E.
uk: Дозволити ШІ генерувати зображення за допомогою DALL-E.

source: Test API Connection
uk: Перевірити з'єднання з API

source: Please enter an API key first.
uk: Спочатку введіть API ключ.

source: API connection successful! Found @count models.
uk: З'єднання з API успішне! Знайдено @count моделей.

source: API connection failed: @message
uk: З'єднання з API не вдалося: @message

source: Finalizing
uk: Завершення

source: Finalizing installation
uk: Завершення встановлення

source: Creating content types...
uk: Створення типів контенту...

source: Enabling modules...
uk: Активація модулів...

source: Configuring layout...
uk: Налаштування макету...

source: Configuring AI integration...
uk: Налаштування інтеграції з ШІ...

source: Clearing caches...
uk: Очищення кешу...

source: Installation completed successfully.
uk: Встановлення успішно завершено.

source: Installation encountered errors.
uk: Під час встановлення виникли помилки.

source: Applying default configuration...
uk: Застосування конфігурації за замовчуванням...

source: Choose Language
uk: Виберіть мову

source: Select installation language
uk: Виберіть мову встановлення

source: Verify Requirements
uk: Перевірка вимог

source: Check system requirements
uk: Перевірте системні вимоги

source: Database Setup
uk: Налаштування бази даних

source: Configure database connection
uk: Налаштуйте з'єднання з базою даних

source: Install
uk: Встановлення

source: Install Drupal and modules
uk: Встановіть Drupal та модулі

source: Installing Constructor
uk: Встановлення Constructor

source: Installing Constructor Profile
uk: Встановлення профілю Constructor

source: Please wait while we configure your site...
uk: Будь ласка, зачекайте, поки ми налаштовуємо ваш сайт...

source: This may take a few moments
uk: Це може зайняти кілька хвилин

source: Powered by Drupal 11
uk: Працює на Drupal 11

source: Step
uk: Крок

source: Configuring site
uk: Налаштування сайту

source: Preparing your site...
uk: Підготовка вашого сайту...

source: Title
uk: Заголовок

source: Body
uk: Тіло

source: Image
uk: Зображення

source: Tags
uk: Теги

source: Required
uk: Обов'язково

source: admin
uk: адмін
