Repository: kindrakevich-agency/constructor
Catalog: web/modules/custom/simple_metatag/translations/*.po
Languages: uk

source: Simple Metatag
uk: Прості метатеги

source: Path-based Metatag Overrides
uk: Перевизначення метатегів на основі шляху

source: Add Path-based Metatag Override
uk: Додати перевизначення метатегів

source: Edit Path-based Metatag Override
uk: Редагувати перевизначення метатегів

source: Path Overrides
uk: Перевизначення шляхів

source: Settings
uk: Налаштування

source: Path
uk: Шлях

source: Enter the path pattern (e.g., /blog/*, /about, or &lt;front&gt; for homepage). Use * as wildcard.
uk: Введіть шаблон шляху (наприклад, /blog/*, /about, або &lt;front&gt; для головної сторінки). Використовуйте * як підстановочний знак.

source: Domains
uk: Домени

source: Select domains. Leave empty to apply to all domains.
uk: Виберіть домени. Залиште порожнім для застосування до всіх доменів.

source: Language
uk: Мова

source: Select language. Leave empty for all languages.
uk: Виберіть мову. Залиште порожнім для всіх мов.

source: - All languages -
uk: - Усі мови -

source: Meta Title
uk: Мета-заголовок

source: Meta Description
uk: Мета-опис

source: Image
uk: Зображення

source: Upload an image for og:image metatag.
uk: Завантажте зображення для метатегу og:image.

source: Save
uk: Зберегти

source: Path-based metatag override updated.
uk: Перевизначення метатегів оновлено.

source: Path-based metatag override created.
uk: Перевизначення метатегів створено.

source: Google Tag Code
uk: Код Google Tag

source: Google Tag Codes
uk: Коди Google Tag

source: Configure Google Tag (gtag.js) code. The tag will be automatically injected into your site's &lt;head&gt; section.
uk: Налаштуйте код Google Tag (gtag.js). Тег буде автоматично вставлено у секцію &lt;head&gt; вашого сайту.

source: Configure Google Tag (gtag.js) codes for different domains. The appropriate tag will be automatically injected into your site's &lt;head&gt; section based on the current domain.
uk: Налаштуйте коди Google Tag (gtag.js) для різних доменів. Відповідний тег буде автоматично вставлено у секцію &lt;head&gt; вашого сайту на основі поточного домену.

source: Default Google Tag (All Domains)
uk: Google Tag за замовчуванням (усі домени)

source: This Google Tag will be used as a fallback for domains not specifically configured above.
uk: Цей Google Tag буде використовуватися як резервний для доменів, не налаштованих окремо вище.

source: Metatags
uk: Метатеги

source: Meta Image
uk: Мета-зображення

source: Administer Simple Metatag
uk: Адміністрування простих метатегів
